{"meta":{"title":"C1ick3r's Blog","subtitle":"C1ick3r的博客","description":"暂时测试哦","author":"C1ick3r","url":"https://C1ick3r.co"},"pages":[{"title":"first try","date":"2019-02-06T12:23:15.000Z","updated":"2019-02-06T12:24:58.970Z","comments":true,"path":"index.html","permalink":"https://C1ick3r.co/index.html","excerpt":"","text":"C1ick3r’s BlogThis is a test page and the first trial for a C1ick3r’s Blog via Gitbook IO.These hooks for node.js are used for only test uses, not for commercial use. 该页面为测试页面，且为通过Gitbook IO来建立C1ick3r的博客的首测。本页面所基于node.js所使用的HOOK仅用于测试，并非商业用途。"},{"title":"comment_rules","date":"2019-02-07T10:16:49.000Z","updated":"2019-02-07T11:45:57.190Z","comments":true,"path":"comment-rules.html","permalink":"https://C1ick3r.co/comment-rules.html","excerpt":"","text":"Comment Policy##Community, Comments and BadasseryLet’s take a minute to talk about the Badass Digest comments and community, the rules and regulations and what your opinions are about them all. By DEVIN FARACI May. 05, 2012 I just did something historic: I shut down a comment thread. It was on the “Coldplay cover the Beastie Boys” article, and the closing comes on the heels of a bunch of bannings over the last few days, so I think this is a good time for all of us to talk together about this site as a community. First of all, I want to reiterate that I believe in community and comments on websites. I look at popular sites with zero comments on articles and I’m baffled. How is that possible? I like the idea of readers being involved and part of the discussion. Wait, scratch that - I LOVE the idea. I started my ‘career’ as a film critic because I was a commenter on a site. I think the back and forth of the web is what makes it all valuable. We used to have rules on the comments section but they got stripped away when we changed content management systems. Maybe we need to put the rules back up, but in the meantime I want to run down some of the important ones: 1) This is our house. We like having you over here, but it’s still our house, and we’re going to have our own rules. If you don’t like them, you don’t need to be in our house. 2) As this is our house we’ll make our own judgment calls about what reflects poorly on our house. If you’re running around dropping racist or sexist or homophobic comments (even if they’re not full of swear words or slurs), we’ll kick your ass out. It turns out that we’ll do the same if you decide to be a passionate defender of unbridled mediocrity. The site name is ‘Badass Digest,’ and while the definition of ‘Badass’ is pretty broad, there are some things that just don’t fit. Like Coldplay. 3) You don’t have to agree with us. I don’t expect you to, and I like when you disagree with me. But you’re going to have to disagree in a basically respectful way. That means attacking the OPINION, not the person giving the opinion. I’m pretty serious about this. I’ll accept some comments on the edge about me, but if you attack the personal qualities of the other writers, you’re toast right away. 3b) If you accuse us of being in the pocket for some studio or movie or whatever, you’re out of here. I don’t have time for that stuff, which I actually find MORE offensive than telling me I’m gay. 3c) That first part goes for other commenters’ opinions, by the way. 4) If you post something libelous about a celebrity I’ll ban you. Note that ‘So and so is an asshole’ is not libelous. ‘So and so is a rapist’ when they haven’t been accused/convicted of rape IS. I can’t believe I have to even say this, but it came up last week.Those are the really hard and fast rules. Here are some ‘suggestions’ that aren’t quite rules: a) Don’t make corrections in the comments. Nobody likes freelance copy editors. If you’re really concerned about us making a typo, there’s a ‘Contact us’ page, or just email me at devin at badassdigest.com. Correcting typos in public makes you look like a dick. a1) Just so we’re clear, that doesn’t apply to when we’re dead wrong on a fact that is part of the point we’re making. If you’re disagreeing with my opinion on a subject and that opinion is based on bad facts, that shit is fair game. b) Don’t say ‘meh.’ It makes you look stupid. c) Don’t come into a thread just to say how little you care. Don’t get into an argument with someone where your whole premise is ‘it’s stupid to argue about this.’ We care, and we think it’s worth arguing about. d) Shut up about Film Crit Hulk’s style. If you don’t like it, don’t read it. We have plenty of other stuff here and hopefully some of that is to your taste. His articles are well-marked. e) Be expansive! we like in-depth comments. Be funny! We like wit. Be saucy! We have no restrictions on word use. Be crazy! We like well-argued opinions that stray far outside the mainstream. Don’t be safe! This isn’t a middle of the road site, so don’t feel the need to conform. I feel like the comments and commenters are a huge part of this site. I love reading the comments, even the ones that sort of piss me off. Especially when they piss me off by disagreeing with me and being RIGHT. I start checking comments as soon as I post a story, and I love seeing familiar names pop in to drop great wisdom and good jokes. And I’ll admit to being torn about closing the Coldplay article. Maybe I should have let it go on. But I don’t believe that the customer is always right, and I think I would have done the same if the thread was people vigorously defending Jack &amp; Jill. This site is no place for mainstream, populist, generic swill. I honestly hate the idea of a new reader coming to a site called Badass Digest and seeing 80 comments defending Coldplay. It’s simply not right. Your turn. I’m not necessarily looking for positive reinforcement here, so you don’t have to just post ‘Good work!’ or whatever. I’m not keeping a list of people who ‘supported’ me. I used to write for a site where being ‘home team’ was everything, and I have come to realize what a horrible, cult of personality system that is. I’m more interested in hearing honest criticisms and advice for how to better maintain the community here. And I’m also interested in your opinions on me closing the thread. I’m not interested in your opinion on Coldplay, though - just the action I took."}],"posts":[{"title":"First try","slug":"First try","date":"2019-02-06T12:23:15.000Z","updated":"2019-02-08T07:40:00.972Z","comments":true,"path":"2019/02/06/First try/","link":"","permalink":"https://C1ick3r.co/2019/02/06/First try/","excerpt":"","text":"C1ick3r’s BlogThis is a test page and the first trial for a C1ick3r’s Blog via Gitbook IO.These hooks for node.js are used for only test uses, not for commercial use. 该页面为测试页面，且为通过Gitbook IO来建立C1ick3r的博客的首测。本页面所基于node.js所使用的HOOK仅用于测试，并非商业用途。","categories":[],"tags":[]},{"title":"MarkDown语法学习","slug":"MarkDown语法学习","date":"2018-09-26T13:20:13.000Z","updated":"2019-02-08T07:44:37.535Z","comments":true,"path":"2018/09/26/MarkDown语法学习/","link":"","permalink":"https://C1ick3r.co/2018/09/26/MarkDown语法学习/","excerpt":"","text":"MarkDown 语法学习 知识本身并没有告诉人们怎样运用它，运用的方法乃在书本之外。 培根 已经受够了传统的html编辑和模块化编辑了。仔细想了想有没有一种所谓能“好读又好写”的编辑方式，发现[MarkDown] []语法真的很适合了。[MarkDown]: https://zh.mweb.im/markdown-syntax-guide-full-version-zh.html 1. 文本格式1.1 标题对比与word等传统编辑方式，MarkDown明显具有更便捷的优势。预设标题分为六种： 标题一标题二标题三标题四标题五标题六其实只需在标题前输入相应数量的#字符就ok。 # 标题一 ## 标题二 ### 标题三 #### 标题四 ##### 标题五 ###### 标题六 或者 标题一 ===== 标题二 ----- 非常的便捷了。 1.2. 强调方式非常直观了，MarkDown的强调方式分为：斜体粗体粗斜体 *斜体* **粗体** ***粗斜体*** 1.3. 分割线非常直观了比如说 === 这种分割线只需要键入一个空行然后下加 === 或者 --- 或者 ___ 或者 *** 就好。粗细不同，自己试试看吧。 1.4. 引语的使用一个&gt;搞定例如： 多说一个字都是求。——-新疆谚语 实际上只需要 &gt;多说一个字都是求。 -------新疆谚语 而且可以进行嵌套如本文引语： 知识本身并没有告诉人们怎样运用它，运用的方法乃在书本之外。 培根 实际很简单 &gt; 知识本身并没有告诉人们怎样运用它，运用的方法乃在书本之外。 &gt; &gt;培根 1.5. 列表 这1.1 有 种2.1 一 列3.1 点 表9.1 酷 哈6.1 炫 1. 这 1.1 有 2. 种 2.1 一 3. 列 3.1 点 9. 表 9.1 酷 6. 哈 6.1 炫 无非就是 “num.空格”可以看出，它会在主列表(第一层列表)自动纠错。在列表内别的语法也都通用。 2. 代码块引用据我自己了解啦，其实这个和引用差不多啦。首先得说说空格和tab的关系： MarkDown语法中，四个空格相当于一个tab。 在需要引用的代码前加入八个空格或者两个tab，就可以引用代码了 printf:(&quot;Hello world!&quot;) 而如果超过八个空格或两个tab的空格，就被视作普通的空格啦。 printf:(&quot;Hello world!&quot;) 反引号(tab上方)的话是另一种样式printf:(&quot;Hello world!&quot;)实际输入： `printf:(&quot;Hello world!&quot;)` 3. 超链接调用3.1. 文本超链接这个MarkDown语法就很宽松了譬如C1ick3r的博客这种链接调用可以有多种写法：C1ick3r的博客:http://c1ick3r.co/可以这样在文中写个tag，然后再文末补上： 譬如[C1ick3r的博客][]这种链接调用可以有多种写法： 文中输入[自定义tag][] 在文末补充[自定义tag]:(链接url) 也可以： 直接[链接title](链接url） 如果要链接到当前主机内，你甚至可以使用相对路径，譬如：C1ick3r的博客 [C1ick3r的博客](/) 非常好用了。超链接调用还有一个用法，就是id定义啦。当才思泉涌的时候要插入多个链接，那岂不是贼麻烦？用id大法的话就很方便。譬如：我昨天买了[iPhone X][1], [iPad Pro][2]和一台新款的[MacBook Pro][3]。[1]:https://www.apple.com/iphone-x/ “新买的iPhone X”[2]:https://www.apple.com/ipad-pro/ “新买的iPad Pro”[3]:https://www.apple.com/macbook-pro/ “新买的MacBook Pro” 实际上只需要在文中插入id 我昨天买了[iPhone X][1], [iPad Pro][2]和一台新款的[MacBook Pro][3]。 然后在文末插入id对应链接： [1]:https://www.apple.com/iphone-x/ &quot;新买的iPhone X&quot; [2]:https://www.apple.com/ipad-pro/ &quot;新买的iPad Pro&quot; [3]:https://www.apple.com/macbook-pro/ &quot;新买的MacBook Pro&quot; 这里的双引号内的副标题就是鼠标悬浮时弹出的标题啦。 3.2. 图片超链接![University of Nottingham](https://www.nottingham.edu.cn/siteelementshomepage/images/logo.svg) ![University of Nottingham] (https://www.nottingham.edu.cn/siteelementshomepage/images/logo.svg) 用不用另起一行都可以。有一个问题就是它调用图片只能使用现成的图床…先上传到主机然后调用就ok了。 3.3 行内跳转有的时候想做个目录树，可是如何实现文内跳转呢？首先引入一个锚点概念：将标题视为一个tag，先在标题加入tag，然后在需要跳转的地方引用这个tag。 [这是需要引用的文本](#标签名称) E.g.我要飞飞到这里： [我要飞](#me) &lt;span id = &quot;me&quot;&gt;飞到这里：&lt;/span&gt; tag仅支持半角字符，字母为小写，空格为下划线。 4. 表格如下表 姓名（居左效果） 血型（居中效果） 本人身份证号（居右效果） 张三 O 310101** |姓名（居左效果）|血型（居中效果）|本人身份证号（居右效果）| |:---|:---:|---:| |张三|O|310101************| 是很简单了第二行的每一栏冒号的位置代表位置，冒号在左代表居左，在右居右，两侧居中，不加的话默认居中。 5. 小技巧5.1首行缩进在句首插入对应字符串可进行相应缩进：&ensp; 这是半角空格缩进&emsp; 这是全角空格缩进 &amp;ensp; 这是半角空格缩进 &amp;emsp; 这是全角空格缩进 5.2 TOC生成目录树想生成如下的目录树吗 [Toc] 只需 [Toc] 即可 善用Toc生成的标签，可快速跳转，例如跳至3.3的行内跳转，点击这里 [点击这里](#toc_18) 自行查找标签吧 6. 编辑器主流文本编辑器其实都比较兼容MarkDown语法啦试用过几个不同的编辑器(MacOS)，最终决定使用的还是[Mweb][]啦。用[Mweb]的话发表文章比较方便。[Mweb]:https://www.mweb.im/Windows下的话我再找找看啦，没找到趁手的，有朋友知道的话欢迎评论啦。 7. 总结工具永远都是层出不穷的，其实还是要看实用工具的人是否有创新的意识。只有不断地更新、强化自己的思维方式，才能在自己的道上越走越远。有关MarkDown的内容我会不断补充更新的，敬请关注啦。(完成于：2018年08月11日10:32:34）(最后更新时间：2018年09月26日21:20:13）","categories":[],"tags":[]}]}