{"meta":{"title":"C1ick3r's Blog","subtitle":"C1ick3r的博客","description":"暂时测试哦","author":"C1ick3r","url":"https://C1ick3r.co"},"pages":[{"title":"comment_rules","date":"2019-02-07T10:16:49.000Z","updated":"2019-02-07T11:45:57.190Z","comments":true,"path":"comment-rules.html","permalink":"https://C1ick3r.co/comment-rules.html","excerpt":"","text":"Comment Policy##Community, Comments and BadasseryLet’s take a minute to talk about the Badass Digest comments and community, the rules and regulations and what your opinions are about them all. By DEVIN FARACI May. 05, 2012 I just did something historic: I shut down a comment thread. It was on the “Coldplay cover the Beastie Boys” article, and the closing comes on the heels of a bunch of bannings over the last few days, so I think this is a good time for all of us to talk together about this site as a community. First of all, I want to reiterate that I believe in community and comments on websites. I look at popular sites with zero comments on articles and I’m baffled. How is that possible? I like the idea of readers being involved and part of the discussion. Wait, scratch that - I LOVE the idea. I started my ‘career’ as a film critic because I was a commenter on a site. I think the back and forth of the web is what makes it all valuable. We used to have rules on the comments section but they got stripped away when we changed content management systems. Maybe we need to put the rules back up, but in the meantime I want to run down some of the important ones: 1) This is our house. We like having you over here, but it’s still our house, and we’re going to have our own rules. If you don’t like them, you don’t need to be in our house. 2) As this is our house we’ll make our own judgment calls about what reflects poorly on our house. If you’re running around dropping racist or sexist or homophobic comments (even if they’re not full of swear words or slurs), we’ll kick your ass out. It turns out that we’ll do the same if you decide to be a passionate defender of unbridled mediocrity. The site name is ‘Badass Digest,’ and while the definition of ‘Badass’ is pretty broad, there are some things that just don’t fit. Like Coldplay. 3) You don’t have to agree with us. I don’t expect you to, and I like when you disagree with me. But you’re going to have to disagree in a basically respectful way. That means attacking the OPINION, not the person giving the opinion. I’m pretty serious about this. I’ll accept some comments on the edge about me, but if you attack the personal qualities of the other writers, you’re toast right away. 3b) If you accuse us of being in the pocket for some studio or movie or whatever, you’re out of here. I don’t have time for that stuff, which I actually find MORE offensive than telling me I’m gay. 3c) That first part goes for other commenters’ opinions, by the way. 4) If you post something libelous about a celebrity I’ll ban you. Note that ‘So and so is an asshole’ is not libelous. ‘So and so is a rapist’ when they haven’t been accused/convicted of rape IS. I can’t believe I have to even say this, but it came up last week.Those are the really hard and fast rules. Here are some ‘suggestions’ that aren’t quite rules: a) Don’t make corrections in the comments. Nobody likes freelance copy editors. If you’re really concerned about us making a typo, there’s a ‘Contact us’ page, or just email me at devin at badassdigest.com. Correcting typos in public makes you look like a dick. a1) Just so we’re clear, that doesn’t apply to when we’re dead wrong on a fact that is part of the point we’re making. If you’re disagreeing with my opinion on a subject and that opinion is based on bad facts, that shit is fair game. b) Don’t say ‘meh.’ It makes you look stupid. c) Don’t come into a thread just to say how little you care. Don’t get into an argument with someone where your whole premise is ‘it’s stupid to argue about this.’ We care, and we think it’s worth arguing about. d) Shut up about Film Crit Hulk’s style. If you don’t like it, don’t read it. We have plenty of other stuff here and hopefully some of that is to your taste. His articles are well-marked. e) Be expansive! we like in-depth comments. Be funny! We like wit. Be saucy! We have no restrictions on word use. Be crazy! We like well-argued opinions that stray far outside the mainstream. Don’t be safe! This isn’t a middle of the road site, so don’t feel the need to conform. I feel like the comments and commenters are a huge part of this site. I love reading the comments, even the ones that sort of piss me off. Especially when they piss me off by disagreeing with me and being RIGHT. I start checking comments as soon as I post a story, and I love seeing familiar names pop in to drop great wisdom and good jokes. And I’ll admit to being torn about closing the Coldplay article. Maybe I should have let it go on. But I don’t believe that the customer is always right, and I think I would have done the same if the thread was people vigorously defending Jack &amp; Jill. This site is no place for mainstream, populist, generic swill. I honestly hate the idea of a new reader coming to a site called Badass Digest and seeing 80 comments defending Coldplay. It’s simply not right. Your turn. I’m not necessarily looking for positive reinforcement here, so you don’t have to just post ‘Good work!’ or whatever. I’m not keeping a list of people who ‘supported’ me. I used to write for a site where being ‘home team’ was everything, and I have come to realize what a horrible, cult of personality system that is. I’m more interested in hearing honest criticisms and advice for how to better maintain the community here. And I’m also interested in your opinions on me closing the thread. I’m not interested in your opinion on Coldplay, though - just the action I took."},{"title":"first try","date":"2019-02-06T12:23:15.000Z","updated":"2019-02-06T12:24:58.970Z","comments":true,"path":"index.html","permalink":"https://C1ick3r.co/index.html","excerpt":"","text":"C1ick3r’s BlogThis is a test page and the first trial for a C1ick3r’s Blog via Gitbook IO.These hooks for node.js are used for only test uses, not for commercial use. 该页面为测试页面，且为通过Gitbook IO来建立C1ick3r的博客的首测。本页面所基于node.js所使用的HOOK仅用于测试，并非商业用途。"}],"posts":[{"title":"first try","slug":"First try","date":"2019-02-06T12:23:15.000Z","updated":"2019-02-06T12:24:58.970Z","comments":true,"path":"2019/02/06/First try/","link":"","permalink":"https://C1ick3r.co/2019/02/06/First try/","excerpt":"","text":"C1ick3r’s BlogThis is a test page and the first trial for a C1ick3r’s Blog via Gitbook IO.These hooks for node.js are used for only test uses, not for commercial use. 该页面为测试页面，且为通过Gitbook IO来建立C1ick3r的博客的首测。本页面所基于node.js所使用的HOOK仅用于测试，并非商业用途。","categories":[],"tags":[]}]}